# IFCParameter Template Copy Property Set Method

Source: https://www.revitapidocs.com/2026/86c1ccb7-0e19-ae00-37cb-c00060baa996.htm

---

| IFCParameter Template Copy Property Set Method |
| --- |

Creates a copy of the property set and adds it to the template.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void CopyPropertySet(
	PropertySetupType propertySetupType,
	string propertySetName,
	string propertySetCopyName
)
```

```
Public Sub CopyPropertySet (
	propertySetupType As PropertySetupType,
	propertySetName As String,
	propertySetCopyName As String
)
```

```
public:
void CopyPropertySet(
	PropertySetupType propertySetupType,
	String^ propertySetName,
	String^ propertySetCopyName
)
```

```
member CopyPropertySet :
        propertySetupType : PropertySetupType *
        propertySetName : string *
        propertySetCopyName : string -> unit
```

#### Parameters

propertySetupType PropertySetupType
:   The property setup type.

propertySetName String
:   The property set name.

propertySetCopyName String
:   The name of the copied property set.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | A property set with the given name is not present in the template.  \-or\-  A property set with the given name already exists in the template. |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace